from aiogram import types

from loader import dp


@dp.message_handler(text="/tungi")
async def show_menu(message: types.Message):
    msg = f"<b>Tungi zikrlar:</b>\n\n"
    msg+="""<b>1. Кечки зикр
'أمْسَينَا وَأَمْسَى الْمُلْكُ للهِ رَبِّ العَالَمِينَ. اللهُمَّ أَسْأَلُكَ خَيْرَ هَذِهِ اللَّيلَةِ، فَتْحَهَا وَنَصْرَهَا وَنُورَهَا وَبَرَكَتَهَا وَهُدَاهَا وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهَا، وَشَرِّ مَا بَعْدَهَا'

«Амсайнаа ва амсал мулку лиллаҳи роббил ъаламийн. Аллоҳумма ас`алука хойра ҳазиҳил лайлати фатҳаҳаа ва насроҳаа ва нуроҳаа ва барокатаҳаа ва ҳудаҳаа ва аъузу бика мин шарри ма фийҳаа ва шарри маа баъдаҳаа»

Маъноси: “Биз ҳам, мулк ҳам оламлар парвардигори Аллоҳники бўлган ҳолда кеч киргиздик. Эй Раббим, бу кечанинг яхшисини, фатҳ бўлишини, ғалабасини, нурини, баракасини, ҳидоятини сўрайман. Ва Сендан бу кечанинг ва бу кечадан кейингисининг ёмонлигидан паноҳ тилайман”

2. Кечки зикр
'رَضِيتُ بِاللهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ صلى الله عليه وسلم رَسُولاً'

«Розийту биллаҳи роббан ва бил ислами дийнан ва бимуҳаммадин соллаллоҳу алайҳи васаллама росула»

Маъноси: “Аллоҳни раббим деб, Исломни диним деб, Муҳаммад алайҳиссаломни расул деб рози бўлдим”

3. Кечки зикр
'اللهُمَّ مَا أَمْسَى بِي مِنْ نِعْمَةٍ فَمِنْكَ وَحْدَكَ، لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ'

«Аллоҳумма маа амсаа бий мин ниъматин фаминка ваҳдака лаа шарийка лак, фалакал ҳамду ва лакаш шукр»

Маъноси: “Аллоҳим, мен билан кеч киргизган неъматлар Сенинг якка Ўзинг томондандир. Сен яккаю ёлғиздирсан, Сенинг шеригинг йўқ. Сенга ҳамд ва шукрлар бўлсин”
</b>"""
    await message.reply(msg)
