from aiogram import types

from loader import dp


@dp.message_handler(text="/tonggi")
async def show_menu(message: types.Message):
    msg = f"<b>Тонгги зикр:</b>\n\n"
    msg+="""<b>1. Тонгги зикр
'رَضِيتُ بِاللهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ صلى الله عليه وسلم رَسُولاً'

«Розийту биллаҳи роббан ва бил ислами дийнан ва бимуҳаммадин соллаллоҳу алайҳи васаллама росула»

Маъноси: “Аллоҳни раббим деб, Исломни диним деб, Муҳаммад алайҳиссаломни расул деб рози бўлдим”

2. Тонг отганида ва кун ботганида
'اللهُمَّ إنِّي أصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ وَجَمِيعَ خَلْقِكَ، أَنَّكَ أنْتَ اللهُ لاَ إلَهَ إلاَّ أنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ'

«Аллоҳумма инний асбаҳту ушҳидука ва ушҳиду ҳамалата ъаршика ва малаикатика ва жамийъа холқик, аннака анталлоҳу лаа илаҳа илла анта ваҳдака лаа шарийка лака ва анна Муҳаммадан ъабдука ва росулук»

Маъноси: “Аллоҳим, албатта, мен тонг оттирдим. Сени ҳамда аршингни кўтарувчи фаришталарингни ва ҳамма халқ қилган нарсаларингни гувоҳ қилиб айтаманки, Сендан бошқа илоҳ йўқ, Муҳаммад соллаллоҳу алайҳи васаллам Сенинг банданг ва расулингдир”

3. Тонг отганида
'اللهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ، فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ'

«Аллоҳумма маа асбаҳа бий мин ниъматин фаминка ваҳдака лаа шарийка лак, фалакал ҳамду ва лакаш шукр»

Маъноси: “Аллоҳим, мен билан тонг оттирган неъматлар Сен томондандир. Сен яккаю ёлғиздирсан, Сенинг шеригинг йўқ. Сенга ҳамд ва шукрлар бўлсин”
</b>"""
    await message.reply(msg)
