from aiogram import types

from loader import dp


@dp.message_handler(text="/zikrlar")
async def show_menu(message: types.Message):
    msg = f"<b>Zikrlar:</b>\n\n"
    msg+="""<b>1. Саййидул истиғфор

'اللهُمَّ أَنْتَ رَبِّي، لاَ إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي، وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ'

«Аллоҳумма анта роббий ла илаҳа илла анта холақтаний ва ана ъабдука ва ана ъала ъаҳдика ва ваъдика мастатоъту аъузу бика мин шарри ма сонаъту, абу`у лака биниъматика ъалаййа ва абу`у бизамбий фағфирлий фаиннаҳу ла йағфируз зунуба илла анта»

Маъноси: “Аллоҳим, Сен парвардигоримсан, Сендан бошқа илоҳ йўқ. Мени халқ қилдинг ва мен Сенинг қулингман. Мен Сенга берган ваъдамда ва Сенга берган аҳдимда қодир бўлганимча турибман. Қилган нарсаларимнинг ёмонидан Сенинг номинг билан паноҳ тилайман. Менга ато қилган неъматларингга иқрор бўлдим. Ва яна гуноҳларимга ҳам иқрор бўлдим. Менинг гуноҳларимни кечир. Чунки Сендан бошқаси гуноҳларни кечира олмайди”

2. Курсий ояти

'بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ اللَّهُ لا إِلٰهَ إِلاَّ هُوَ الحَيُّ القَيّومُ ۚ لا تَأخُذُهُ سِنَةٌ وَلا نَومٌ ۚ لَهُ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ مَن ذَا الَّذي يَشفَعُ عِندَهُ إِلاَّ بِإِذنِهِ ۚ يَعلَمُ ما بَينَ أَيديهِم وَما خَلفَهُم ۖ وَلا يُحيطونَ بِشَيءٍ مِن عِلمِهِ إِلاَّ بِما شاءَ ۚ وَسِعَ كُرسِيُّهُ السَّماواتِ وَالأَرضَ ۖ وَلا يَئودُهُ حِفظُهُما ۚ وَهُوَ العَلِيُّ العَظيمُ'

Бисмиллаҳир роҳманир роҳийм. Аллоҳу лаа илаҳа иллаҳув алҳаййул қойюм. Лаа таъхузуҳу синатув валаа навм. Лаҳуу маа фис самаваати ва маа фил арз. Ман заллазий йашфаъу ъиндаху иллаа биизниҳ. Йаъламу маа байна айдийҳим ва маа холфаҳум. Ва лаа йуҳийтувна бишайъим мин ъилмиҳи илла бимаа шаа. Васиъа курсиййуҳус самаваати вал арз. Ва лаа йаувдуҳу ҳифзуҳума ва ҳувал ъалиййул ъазийм.

Маъноси: Меҳрибон ва раҳмли Аллоҳнинг номи ила бошлайман. Аллоҳ, Ундан ўзга илоҳ йўқ. У тирикдир ва қаййумдир. Уни мудроқ ҳам, уйқу ҳам олмас. Осмонлару ердаги нарсалар Уникидир. Унинг ҳузурида ўзининг изнисиз ҳеч ким шафоат қила олмас. У уларнинг олдиларидаги нарсани ҳам, ортларидаги нарсани ҳам билур. Унинг илмидан ҳеч нарсани иҳота қила олмаслар, магар ўзи хоҳлаганини, холос. Унинг курсиси осмонлару ерни қамраган. У уларни муҳофаза қилишдан чарчамас. Ва У Алий ва Азим зотдир.

3. Аллоҳда ҳамд айтиш ва поклаш
'سُبْحَانَ اللهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَى نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ'

«Субҳаналлоҳи ва биҳамдиҳи ъадада холқиҳи ва ризо нафсиҳи ва зината ъаршиҳи ва мидаада калимаатиҳи»

Маъноси: “Яратганларининг ададича, нафси рози бўлгунича, аршнинг вазнича, калималарнинг узунлигича Аллоҳга ҳамд айтаман ва Уни поклайман”
</b>"""
    await message.reply(msg)
